app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      art = Artist.find_or_create_by(name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-03-01 20:56:04.731535"], ["updated_at", "2019-03-01 20:56:04.731535"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-03-01 20:56:04.737821"], ["updated_at", "2019-03-01 20:56:04.737821"], ["artist_id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]